export const problem = {
  V2: {
    layout: [
      '......x',
      '......x',
      '.......',
      '.......',
      '.......',
      '.......',
      '.......',
      'xxxx...'
    ],
    block: [
      [
        'x...',
        'xxxx',
      ],
      [
        '..x',
        'xxx',
        'x..',
      ],
      [
        'xx..',
        '.xxx',
      ],
      [
        '.xx',
        'xxx',
      ],
      [
        'x.x',
        'xxx',
      ],
      [
        'x..',
        'x..',
        'xxx',
      ],
      [
        'xxxx',
        '....',
      ],
      [
        'x..',
        'xxx',
      ],
      [
        '.xx',
        'xx.'
      ],
      [
        '.x.',
        '.x.',
        'xxx',
      ],
    ],
    row: 8,
    month_names: [
      'JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN',
      'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC',
    ]
  },
  V2Beta: {
    layout: [
      '......x',
      '......x',
      '.......',
      '.......',
      '.......',
      '.......',
      '.......',
      '...xxxx',
    ],
    block: [
      [
        'x...',
        'xxxx',
      ],
      [
        '..x',
        'xxx',
        'x..',
      ],
      [
        'xx..',
        '.xxx',
      ],
      [
        '.xx',
        'xxx',
      ],
      [
        'x.x',
        'xxx',
      ],
      [
        'x..',
        'x..',
        'xxx',
      ],
      [
        'xxxx',
        '....',
      ],
      [
        'x..',
        'xxx',
      ],
      [
        '.xx',
        'xx.'
      ],
      [
        '.x.',
        '.x.',
        'xxx',
      ],
    ],
    row: 8,
    month_names: [
      'JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN',
      'JUL', 'AUG', 'SEP', 'OCT', 'NOV', 'DEC',
    ]
  },
  V1: {
    layout: [
      '......x',
      '......x',
      '.......',
      '.......',
      '.......',
      '.......',
      '...xxxx'
    ],
    block: [
      [
        'x...',
        'xxxx',
      ],
      [
        'x..',
        'xxx',
        '..x',
      ],
      [
        '..xx',
        'xxx.',
      ],
      [
        'xxxx',
        '..x.',
      ],
      [
        '.xx',
        'xxx',
      ],
      [
        'xxx',
        'x.x',
      ],
      [
        'xxx',
        'xxx',
      ],
      [
        'x..',
        'x..',
        'xxx',
      ],
    ],
    row: 7,
    month_names: [
      '一月', '二月', '三月', '四月', '五月', '六月',
      '七月', '八月', '九月', '十月', '十一月', '十二月',
    ]
  }
}
